src/Documents/ЗаписьЖурнала/ЗаписьЖурнала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьЖурнала</name>
  <posting>Deny</posting>
  <attributes>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгроваяМинута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/ЖурналКампании/Module.bsl
// Логика работы с журналом активной кампании.
//
// Все операции чтения и записи документа «ЗаписьЖурнала» должны
// выполняться через данный модуль, чтобы UI и будущий AI-слой
// не обращались к документу напрямую.
//

#Область ПрограммныйИнтерфейс

// Добавляет новую запись в журнал активной кампании.
//
// Параметры:
//  Текст - Строка - текст записи. Пробелы по краям игнорируются.
//
// Вызывает исключение, если активная кампания не задана
// или после обрезки текст оказался пустым.
// Если игровое время активной кампании ещё не инициализировано -
// реквизит ИгроваяМинута остаётся незаполненным.
//
Процедура ДобавитьЗапись(Текст) Экспорт

	Кампания = ПараметрыСеанса.АктивнаяКампания;
	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Добавление записи невозможно.'");
	КонецЕсли;

	ТекстЗаписи = СокрЛП(Текст);
	Если ПустаяСтрока(ТекстЗаписи) Тогда
		ВызватьИсключение НСтр("ru = 'Текст записи журнала не может быть пустым.'");
	КонецЕсли;

	НоваяЗапись = Документы.ЗаписьЖурнала.СоздатьДокумент();
	НоваяЗапись.Кампания = Кампания;
	НоваяЗапись.Текст = ТекстЗаписи;
	НоваяЗапись.Автор = Пользователи.ТекущийПользователь();

	ИгроваяМинута = ТекущаяИгроваяМинутаБезопасно();
	Если ИгроваяМинута <> Неопределено Тогда
		НоваяЗапись.ИгроваяМинута = ИгроваяМинута;
	КонецЕсли;

	НоваяЗапись.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры

// Возвращает записи журнала активной кампании.
//
// При указании границ игрового периода выбираются только записи
// с заполненной ИгроваяМинута, попадающей в этот период. Технические
// и внеигровые записи с пустой игровой минутой в выборку не попадают.
//
// Параметры:
//  НачалоИгровогоПериода - Число, Неопределено - нижняя граница игровой минуты.
//                          Если Неопределено - нижняя граница не ограничивается.
//  КонецИгровогоПериода  - Число, Неопределено - верхняя граница игровой минуты.
//                          Если Неопределено - верхняя граница не ограничивается.
//
// Возвращаемое значение:
//   Массив Из ДокументСсылка.ЗаписьЖурнала - элементы ДокументСсылка.ЗаписьЖурнала,
//            упорядоченные по дате документа по возрастанию.
//
Функция ПолучитьЗаписи(НачалоИгровогоПериода = Неопределено,
		КонецИгровогоПериода = Неопределено) Экспорт

	Кампания = ПараметрыСеанса.АктивнаяКампания;

	ЗаданИгровойПериод = НачалоИгровогоПериода <> Неопределено
		ИЛИ КонецИгровогоПериода <> Неопределено;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", Кампания);
	Запрос.УстановитьПараметр("ЗаданПериод", ЗаданИгровойПериод);
	Запрос.УстановитьПараметр("НачалоИгровогоПериода",
		?(НачалоИгровогоПериода = Неопределено, 0, НачалоИгровогоПериода));
	Запрос.УстановитьПараметр("КонецИгровогоПериода",
		?(КонецИгровогоПериода = Неопределено, 999999999999999, КонецИгровогоПериода));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписьЖурнала.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаписьЖурнала КАК ЗаписьЖурнала
		|ГДЕ
		|	ЗаписьЖурнала.Кампания = &Кампания
		|	И ВЫБОР
		|			КОГДА &ЗаданПериод
		|				ТОГДА ЗаписьЖурнала.ИгроваяМинута <> 0
		|						И ЗаписьЖурнала.ИгроваяМинута МЕЖДУ &НачалоИгровогоПериода И &КонецИгровогоПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|УПОРЯДОЧИТЬ ПО
		|	ЗаписьЖурнала.Дата";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Возвращает последние записи журнала активной кампании, упорядоченные
// по дате документа по убыванию.
//
// Параметры:
//  Количество - Число - максимальное количество возвращаемых записей.
//
// Возвращаемое значение:
//   Массив Из ДокументСсылка.ЗаписьЖурнала
//
Функция ПолучитьПоследниеЗаписи(Количество = 20) Экспорт

	Кампания = ПараметрыСеанса.АктивнаяКампания;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", Кампания);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписьЖурнала.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаписьЖурнала КАК ЗаписьЖурнала
		|ГДЕ
		|	ЗаписьЖурнала.Кампания = &Кампания
		|УПОРЯДОЧИТЬ ПО
		|	ЗаписьЖурнала.Дата УБЫВ";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;

	МассивСсылок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

	Если МассивСсылок.Количество() <= Количество Тогда
		Возврат МассивСсылок;
	КонецЕсли;

	Результат = Новый Массив;
	Для Индекс = 0 По Количество - 1 Цикл
		Результат.Добавить(МассивСсылок[Индекс]);
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает текущую игровую минуту активной кампании.
// При отсутствии активной кампании или незаполненном игровом времени
// возвращает Неопределено, не вызывая исключения.
//
// Возвращаемое значение:
//   Число, Неопределено - игровая минута или Неопределено.
//
Функция ТекущаяИгроваяМинутаБезопасно()

	Попытка
		Возврат ИгровоеВремя.ПолучитьТекущееВремя();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

#КонецОбласти
